# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

def func(sp):
    spRezult=[]
    for i in range(0,round((len(sp)+1)/2)):
        spRezult.append(sp[i]*sp[-i-1])
    return spRezult

sp1=[2, 3, 4, 5, 6]
sp2=[2, 3, 5, 6]
print(func(sp1))
print(func(sp2))